{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-648: Collect Data from Screen Capture</b><br>An adversary gathers sensitive information by exploiting the system's screen<br>capture functionality. Through screenshots, the adversary aims to see what<br>happens on the screen over the course of an operation. The adversary can<br>leverage information gathered in order to carry out further attacks.",
      "color": "#94ebff",
      "size": 10,
      "label": "Collect Data from Screen Capture",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/648.html",
      "id": "648"
    },
    {
      "Description": "<b>CAPEC-634: Probe Audio and Video Peripherals</b><br>The adversary exploits the target system's audio and video functionalities<br>through malware or scheduled tasks. The goal is to capture sensitive information<br>about the target for financial, personal, political, or other gains which is<br>accomplished by collecting communication data between two parties via the use of<br>peripheral devices (e.g. microphones and webcams) or applications with audio and<br>video capabilities (e.g. Skype) on a system.",
      "color": "#94ebff",
      "size": 10,
      "label": "Probe Audio and Video Peripherals",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/634.html",
      "id": "634"
    },
    {
      "Description": "<b>CAPEC-462: Cross-Domain Search Timing</b><br>An attacker initiates cross domain HTTP / GET requests and times the server<br>responses. The timing of these responses may leak important information on what<br>is happening on the server. Browser's same origin policy prevents the attacker<br>from directly reading the server responses (in the absence of any other<br>weaknesses), but does not prevent the attacker from timing the responses to<br>requests that the attacker issued cross domain.",
      "color": "#94ebff",
      "size": 10,
      "label": "Cross-Domain Search Timing",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/462.html",
      "id": "462"
    },
    {
      "Description": "<b>CAPEC-546: Incomplete Data Deletion in a Multi-Tenant Environment</b><br>An adversary obtains unauthorized information due to insecure or incomplete data<br>deletion in a multi-tenant environment. If a cloud provider fails to completely<br>delete storage and data from former cloud tenants' systems/resources, once these<br>resources are allocated to new, potentially malicious tenants, the latter can<br>probe the provided resources for sensitive information still there.",
      "color": "#94ebff",
      "size": 10,
      "label": "Incomplete Data Deletion in a Multi-Tenant Environment",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/546.html",
      "id": "546"
    },
    {
      "Description": "<b>CAPEC-261: Fuzzing for garnering other adjacent user/sensitive data</b><br>An adversary who is authorized to send queries to a target sends variants of<br>expected queries in the hope that these modified queries might return<br>information (directly or indirectly through error logs) beyond what the expected<br>set of queries should provide.",
      "color": "#94ebff",
      "size": 10,
      "label": "Fuzzing for garnering other adjacent user/sensitive data",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/261.html",
      "id": "261"
    },
    {
      "Description": "<b>CAPEC-150: Collect Data from Common Resource Locations</b><br>An adversary exploits well-known locations for resources for the purposes of<br>undermining the security of the target. In many, if not most systems, files and<br>resources are organized in a default tree structure. This can be useful for<br>adversaries because they often know where to look for resources or files that<br>are necessary for attacks. Even when the precise location of a targeted resource<br>may not be known, naming conventions may indicate a small area of the target<br>machine's file tree where the resources are typically located. For example,<br>configuration files are normally stored in the /etc director on Unix systems.<br>Adversaries can take advantage of this to commit other types of attacks.",
      "color": "#75aaff",
      "size": 18,
      "label": "Collect Data from Common Resource Locations",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/150.html",
      "id": "150"
    },
    {
      "Description": "<b>CAPEC-143: Detect Unpublicized Web Pages</b><br>An adversary searches a targeted web site for web pages that have not been<br>publicized. In doing this, the adversary may be able to gain access to<br>information that the targeted site did not intend to make public.",
      "color": "#94ebff",
      "size": 10,
      "label": "Detect Unpublicized Web Pages",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/143.html",
      "id": "143"
    },
    {
      "Description": "<b>CAPEC-569: Collect Data as Provided by Users</b><br>An attacker leverages a tool, device, or program to obtain specific information<br>as provided by a user of the target system. This information is often needed by<br>the attacker to launch a follow-on attack. This attack is different than Social<br>Engineering as the adversary is not tricking or deceiving the user. Instead the<br>adversary is putting a mechanism in place that captures the information that a<br>user legitimately enters into a system. Deploying a keylogger, performing a UAC<br>prompt, or wrapping the Windows default credential provider are all examples of<br>such interactions.",
      "color": "#75aaff",
      "size": 18,
      "label": "Collect Data as Provided by Users",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/569.html",
      "id": "569"
    },
    {
      "Description": "<b>CAPEC-144: Detect Unpublicized Web Services</b><br>An adversary searches a targeted web site for web services that have not been<br>publicized. This attack can be especially dangerous since unpublished but<br>available services may not have adequate security controls placed upon them<br>given that an administrator may believe they are unreachable.",
      "color": "#94ebff",
      "size": 10,
      "label": "Detect Unpublicized Web Services",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/144.html",
      "id": "144"
    },
    {
      "Description": "<b>CAPEC-639: Probe System Files</b><br>An adversary obtains unauthorized information due to improperly protected files.<br>If an application stores sensitive information in a file that is not protected<br>by proper access control, then an adversary can access the file and search for<br>sensitive information.",
      "color": "#94ebff",
      "size": 10,
      "label": "Probe System Files",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/639.html",
      "id": "639"
    },
    {
      "Description": "<b>CAPEC-127: Directory Indexing</b><br>An adversary crafts a request to a target that results in the target<br>listing/indexing the content of a directory as output. One common method of<br>triggering directory contents as output is to construct a request containing a<br>path that terminates in a directory name rather than a file name since many<br>applications are configured to provide a list of the directory's contents when<br>such a request is received. An adversary can use this to explore the directory<br>tree on a target as well as learn the names of files. This can often end up<br>revealing test files, backup files, temporary files, hidden files, configuration<br>files, user accounts, script contents, as well as naming conventions, all of<br>which can be used by an attacker to mount additional attacks.",
      "color": "#94ebff",
      "size": 10,
      "label": "Directory Indexing",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/127.html",
      "id": "127"
    },
    {
      "Description": "<b>CAPEC-155: Screen Temporary Files for Sensitive Information</b><br>An adversary exploits the temporary, insecure storage of information by<br>monitoring the content of files used to store temp data during an application's<br>routine execution flow. Many applications use temporary files to accelerate<br>processing or to provide records of state across multiple executions of the<br>application. Sometimes, however, these temporary files may end up storing<br>sensitive information. By screening an application's temporary files, an<br>adversary might be able to discover such sensitive information. For example, web<br>browsers often cache content to accelerate subsequent lookups. If the content<br>contains sensitive information then the adversary could recover this from the<br>web cache.",
      "color": "#94ebff",
      "size": 10,
      "label": "Screen Temporary Files for Sensitive Information",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/155.html",
      "id": "155"
    },
    {
      "Description": "<b>CAPEC-215: Fuzzing for application mapping</b><br>An attacker sends random, malformed, or otherwise unexpected messages to a<br>target application and observes the application's log or error messages<br>returned. The attacker does not initially know how a target will respond to<br>individual messages but by attempting a large number of message variants they<br>may find a variant that trigger's desired behavior. In this attack, the purpose<br>of the fuzzing is to observe the application's log and error messages, although<br>fuzzing a target can also sometimes cause the target to enter an unstable state,<br>causing a crash.",
      "color": "#94ebff",
      "size": 10,
      "label": "Fuzzing for application mapping",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/215.html",
      "id": "215"
    },
    {
      "Description": "<b>CAPEC-95: WSDL Scanning</b><br>This attack targets the WSDL interface made available by a web service. The<br>attacker may scan the WSDL interface to reveal sensitive information about<br>invocation patterns, underlying technology implementations and associated<br>vulnerabilities. This type of probing is carried out to perform more serious<br>attacks (e.g. parameter tampering, malicious content injection, command<br>injection, etc.). WSDL files provide detailed information about the services<br>ports and bindings available to consumers. For instance, the attacker can submit<br>special characters or malicious content to the Web service and can cause a<br>denial of service condition or illegal access to database records. In addition,<br>the attacker may try to guess other private methods by using the information<br>provided in the WSDL files.",
      "color": "#94ebff",
      "size": 10,
      "label": "WSDL Scanning",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/95.html",
      "id": "95"
    },
    {
      "Description": "<b>CAPEC-545: Pull Data from System Resources</b><br>An adversary who is authorized or has the ability to search known system<br>resources, does so with the intention of gathering useful information. System<br>resources include files, memory, and other aspects of the target system. In this<br>pattern of attack, the adversary does not necessarily know what they are going<br>to find when they start pulling data. This is different than CAPEC-150 where the<br>adversary knows what they are looking for due to the common location.",
      "color": "#75aaff",
      "size": 18,
      "label": "Pull Data from System Resources",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/545.html",
      "id": "545"
    },
    {
      "Description": "<b>CAPEC-54: Query System for Information</b><br>An adversary, aware of an application's location (and possibly authorized to use<br>the application), probes an application's structure and evaluates its robustness<br>by submitting requests and examining responses. Often, this is accomplished by<br>sending variants of expected queries in the hope that these modified queries<br>might return information beyond what the expected set of queries would provide.",
      "color": "#75aaff",
      "size": 18,
      "label": "Query System for Information",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/54.html",
      "id": "54"
    },
    {
      "Description": "<b>CAPEC-675: Retrieve Data from Decommissioned Devices</b><br>An adversary obtains decommissioned, recycled, or discarded systems and devices<br>that can include an organization’s intellectual property, employee data, and<br>other types of controlled information. Systems and devices that have reached the<br>end of their lifecycles may be subject to recycle or disposal where they can be<br>exposed to adversarial attempts to retrieve information from internal memory<br>chips and storage devices that are part of the system.",
      "color": "#75aaff",
      "size": 18,
      "label": "Retrieve Data from Decommissioned Devices",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/675.html",
      "id": "675"
    },
    {
      "Description": "<b>CAPEC-498: Probe iOS Screenshots</b><br>An adversary examines screenshot images created by iOS in an attempt to obtain<br>sensitive information. This attack targets temporary screenshots created by the<br>underlying OS while the application remains open in the background.",
      "color": "#94ebff",
      "size": 10,
      "label": "Probe iOS Screenshots",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/498.html",
      "id": "498"
    },
    {
      "Description": "<b>CAPEC-406: Dumpster Diving</b><br>An adversary cases an establishment and searches through trash bins, dumpsters,<br>or areas where company information may have been accidentally discarded for<br>information items which may be useful to the dumpster diver. The devastating<br>nature of the items and/or information found can be anything from medical<br>records, resumes, personal photos and emails, bank statements, account details<br>or information about software, tech support logs and so much more, including<br>hardware devices. By collecting this information an adversary may be able to<br>learn important facts about the person or organization that play a role in<br>helping the adversary in their attack.",
      "color": "#94ebff",
      "size": 10,
      "label": "Dumpster Diving",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/406.html",
      "id": "406"
    },
    {
      "Description": "<b>CAPEC-568: Capture Credentials via Keylogger</b><br>An adversary deploys a keylogger in an effort to obtain credentials directly<br>from a system's user. After capturing all the keystrokes made by a user, the<br>adversary can analyze the data and determine which string are likely to be<br>passwords or other credential related information.",
      "color": "#94ebff",
      "size": 10,
      "label": "Capture Credentials via Keylogger",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/568.html",
      "id": "568"
    },
    {
      "Description": "<b>CAPEC-647: Collect Data from Registries</b><br>An adversary exploits a weakness in authorization to gather system-specific data<br>and sensitive information within a registry (e.g., Windows Registry, Mac plist).<br>These contain information about the system configuration, software, operating<br>system, and security. The adversary can leverage information gathered in order<br>to carry out further attacks.",
      "color": "#94ebff",
      "size": 10,
      "label": "Collect Data from Registries",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/647.html",
      "id": "647"
    },
    {
      "Description": "<b>CAPEC-116: Excavation</b><br>An adversary actively probes the target in a manner that is designed to solicit<br>information that could be leveraged for malicious purposes.",
      "color": "#2176ff",
      "size": 30,
      "label": "Excavation",
      "label_class": "node-label-big",
      "url": "https://capec.mitre.org/data/definitions/116.html",
      "id": "116"
    },
    {
      "Description": "<b>CAPEC-637: Collect Data from Clipboard</b><br>The adversary exploits an application that allows for the copying of sensitive<br>data or information by collecting information copied to the clipboard. Data<br>copied to the clipboard can be accessed by other applications, such as malware<br>built to exfiltrate or log clipboard contents on a periodic basis. In this way,<br>the adversary aims to garner information to which they are unauthorized.",
      "color": "#94ebff",
      "size": 10,
      "label": "Collect Data from Clipboard",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/637.html",
      "id": "637"
    }
  ],
  "links": [
    {
      "source": "648",
      "target": "150"
    },
    {
      "source": "634",
      "target": "545"
    },
    {
      "source": "462",
      "target": "54"
    },
    {
      "source": "546",
      "target": "545"
    },
    {
      "source": "261",
      "target": "54"
    },
    {
      "source": "150",
      "target": "116"
    },
    {
      "source": "143",
      "target": "150"
    },
    {
      "source": "569",
      "target": "116"
    },
    {
      "source": "144",
      "target": "150"
    },
    {
      "source": "639",
      "target": "545"
    },
    {
      "source": "127",
      "target": "54"
    },
    {
      "source": "155",
      "target": "150"
    },
    {
      "source": "215",
      "target": "54"
    },
    {
      "source": "95",
      "target": "54"
    },
    {
      "source": "545",
      "target": "116"
    },
    {
      "source": "54",
      "target": "116"
    },
    {
      "source": "675",
      "target": "116"
    },
    {
      "source": "498",
      "target": "545"
    },
    {
      "source": "406",
      "target": "150"
    },
    {
      "source": "568",
      "target": "569"
    },
    {
      "source": "647",
      "target": "150"
    },
    {
      "source": "637",
      "target": "150"
    }
  ]
}