{
  "directed": true,
  "multigraph": false,
  "graph": {},
  "nodes": [
    {
      "Description": "<b>CAPEC-97: Cryptanalysis</b><br>Cryptanalysis is a process of finding weaknesses in cryptographic algorithms and<br>using these weaknesses to decipher the ciphertext without knowing the secret key<br>(instance deduction). Sometimes the weakness is not in the cryptographic<br>algorithm itself, but rather in how it is applied that makes cryptanalysis<br>successful. An attacker may have other goals as well, such as: Total Break<br>(finding the secret key), Global Deduction (finding a functionally equivalent<br>algorithm for encryption and decryption that does not require knowledge of the<br>secret key), Information Deduction (gaining some information about plaintexts or<br>ciphertexts that was not previously known) and Distinguishing Algorithm (the<br>attacker has the ability to distinguish the output of the encryption<br>(ciphertext) from a random permutation of bits).",
      "color": "#75aaff",
      "size": 18,
      "label": "Cryptanalysis",
      "label_class": "node-label-medium",
      "url": "https://capec.mitre.org/data/definitions/97.html",
      "id": "97"
    },
    {
      "Description": "<b>CAPEC-463: Padding Oracle Crypto Attack</b><br>An adversary is able to efficiently decrypt data without knowing the decryption<br>key if a target system leaks data on whether or not a padding error happened<br>while decrypting the ciphertext. A target system that leaks this type of<br>information becomes the padding oracle and an adversary is able to make use of<br>that oracle to efficiently decrypt data without knowing the decryption key by<br>issuing on average 128*b calls to the padding oracle (where b is the number of<br>bytes in the ciphertext block). In addition to performing decryption, an<br>adversary is also able to produce valid ciphertexts (i.e., perform encryption)<br>by using the padding oracle, all without knowing the encryption key.",
      "color": "#94ebff",
      "size": 10,
      "label": "Padding Oracle Crypto Attack",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/463.html",
      "id": "463"
    },
    {
      "Description": "<b>CAPEC-608: Cryptanalysis of Cellular Encryption</b><br>The use of cryptanalytic techniques to derive cryptographic keys or otherwise<br>effectively defeat cellular encryption to reveal traffic content. Some cellular<br>encryption algorithms such as A5/1 and A5/2 (specified for GSM use) are known to<br>be vulnerable to such attacks and commercial tools are available to execute<br>these attacks and decrypt mobile phone conversations in real-time. Newer<br>encryption algorithms in use by UMTS and LTE are stronger and currently believed<br>to be less vulnerable to these types of attacks. Note, however, that an attacker<br>with a Cellular Rogue Base Station can force the use of weak cellular encryption<br>even by newer mobile devices.",
      "color": "#94ebff",
      "size": 10,
      "label": "Cryptanalysis of Cellular Encryption",
      "label_class": "node-label-small",
      "url": "https://capec.mitre.org/data/definitions/608.html",
      "id": "608"
    },
    {
      "Description": "<b>CAPEC-192: Protocol Analysis</b><br>An adversary engages in activities to decipher and/or decode protocol<br>information for a network or application communication protocol used for<br>transmitting information between interconnected nodes or systems on a<br>packet-switched data network. While this type of analysis involves the analysis<br>of a networking protocol inherently, it does not require the presence of an<br>actual or physical network.",
      "color": "#2176ff",
      "size": 30,
      "label": "Protocol Analysis",
      "label_class": "node-label-big",
      "url": "https://capec.mitre.org/data/definitions/192.html",
      "id": "192"
    }
  ],
  "links": [
    {
      "source": "97",
      "target": "192"
    },
    {
      "source": "463",
      "target": "97"
    },
    {
      "source": "608",
      "target": "97"
    }
  ]
}